results/mxfp8-nightly-tp8-deepep-mxfp8-g32-atg1-normal-dispbf16-low-latency-specon-isl1024-osl1024-c64-n128.log
### tag=mxfp8-nightly-tp8-deepep-mxfp8-g32-atg1-normal-dispbf16-low-latency-specon-isl1024-osl1024-c64-n128
### endpoint=localhost:30000 image=hy4-nightly-deepep:latest
### quant=mxfp8 tp=8 nnodes=1 profile=low-latency spec=on
### topo=nightly-tp8-deepep-mxfp8-g32-atg1-normal-dispbf16 gpus=8 backend=none
### moe_a2a=deepep ep=8 dp_attn=unknown v2_cap=unknown chunk=unknown
### isl=1024 osl=1024 num_prompts=128 concurrency=64 max_running=128
### started=2026-09-08T09:29:16Z
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/awq/awq.py:53: UserWarning: Only CUDA, HIP and XPU support AWQ currently.
  warnings.warn(f"Only CUDA, HIP and XPU support AWQ currently.")
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/gguf.py:69: UserWarning: Only CUDA, MUSA and NPU support GGUF quantization currently.
  warnings.warn(f"Only CUDA, MUSA and NPU support GGUF quantization currently.")
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='localhost', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='tencent/Hy4-preview-FP8', served_model_name=None, tokenizer='/models/Hy4-preview-FP8', num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='/results/mxfp8-nightly-tp8-deepep-mxfp8-g32-atg1-normal-dispbf16-low-latency-specon-isl1024-osl1024-c64-n128.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai', base_url=None, host='localhost', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='tencent/Hy4-preview-FP8', served_model_name=None, tokenizer='/models/Hy4-preview-FP8', num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='/results/mxfp8-nightly-tp8-deepep-mxfp8-g32-atg1-normal-dispbf16-low-latency-specon-isl1024-osl1024-c64-n128.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 131072
#Output tokens: 131072
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 128/128 [05:07<00:00,  2.40s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    inf       
Max request concurrency:                 64        
Successful requests:                     128       
Benchmark duration (s):                  307.64    
Total input tokens:                      131072    
Total input text tokens:                 131072    
Total generated tokens:                  131072    
Total generated tokens (retokenized):    130755    
Request throughput (req/s):              0.42      
Input token throughput (tok/s):          426.06    
Output token throughput (tok/s):         426.06    
Peak output token throughput (tok/s):    192.00    
Peak concurrent requests:                80        
Total token throughput (tok/s):          852.11    
Concurrency:                             48.57     
Accept length:                           3.73      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   116744.82 
Median E2E Latency (ms):                 111113.89 
P90 E2E Latency (ms):                    138572.05 
P95 E2E Latency (ms):                    155670.22 
P99 E2E Latency (ms):                    181005.04 
---------------Time to First Token----------------
Mean TTFT (ms):                          5029.24   
Median TTFT (ms):                        4286.77   
P90 TTFT (ms):                           9700.06   
P95 TTFT (ms):                           9701.34   
P99 TTFT (ms):                           9701.84   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          109.20    
Median TPOT (ms):                        104.29    
P90 TPOT (ms):                           132.07    
P95 TPOT (ms):                           145.02    
P99 TPOT (ms):                           171.50    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           109.22    
Median ITL (ms):                         95.74     
P90 ITL (ms):                            127.48    
P95 ITL (ms):                            191.15    
P99 ITL (ms):                            382.83    
Max ITL (ms):                            5166.14   
==================================================
### finished=2026-09-08T09:34:59Z rc=0